---
kind: property
id: P:Autodesk.Revit.DB.ElementIdParameterValue.Value
source: html/2f706aa4-5138-e192-b928-9a3388ab7b60.htm
---
# Autodesk.Revit.DB.ElementIdParameterValue.Value Property

The stored value

## Syntax (C#)
```csharp
public ElementId Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null